# Taps
tap 'homebrew/bundle'
tap 'remotemobprogramming/brew'
tap 'hashicorp/tap'
tap 'int128/kubelogin'
tap 'kiki-ki/tap'
tap 'mpryor/tap'
tap 'conikeec/tap'
tap 'xan-cloud/tap'
tap 'bookofrat/tap'

# Prerequisites
brew 'gcc'
brew 'make'

# Languages - managed via mise
brew 'mise'

# Git
brew 'git'
brew 'git-lfs'
brew 'gnupg'
brew 'gh'
brew 'glab'
brew 'git-delta'
brew 'lab'
brew 'tig'
brew 'mob'
brew 'pre-commit'
brew 'lazygit'

# Docker & Containers
brew 'colima'
brew 'docker'
brew 'docker-compose'
brew 'lazydocker'

# Kubernetes Ecosystem
brew 'kubernetes-cli'
brew 'krew'
brew 'kubectx'
brew 'k9s'
brew 'int128/kubelogin/kubelogin'
brew 'stern'
brew 'ctop'
brew 'helm'

# Infrastructure as Code
brew 'terragrunt'
brew 'terraform'
brew 'terraform-docs'
brew 'hashicorp/tap/vault'
brew 'terracognita'

# Database & SQL
brew 'pgcli'
brew 'litecli'

# Utilities
brew 'bat'
brew 'bzip2'
brew 'curl'
brew 'csvkit'
brew 'fd'
brew 'findutils'
brew 'fzf'
brew 'htop'
brew 'jq'
brew 'kcat'
brew 'magic-wormhole'
brew 'ripgrep'
brew 'the_silver_searcher'
brew 'unzip'
brew 'yamllint'
brew 'zip'
brew 'watch'
brew 'yq'
brew 'zoxide'
brew 'cookiecutter'
brew 'hurl'
brew 'lsd'
brew 'wget'
brew 'awscli'
brew 'gnu-sed'
brew 'uv'
brew 'tree-sitter-cli'

# Specialized Apps
brew 'conikeec/tap/mcp-probe'
brew 'bookofrat/tap/bookofrat'
brew 'mpryor/tap/nless'
brew 'kiki-ki/tap/qo'
brew 'xan-cloud/tap/xan'

# Applications
brew 'ghostscript'
brew 'imagemagick'
brew 'mermaid-cli'
brew 'neovim'
brew 'octosql'
brew 'tmux'
brew 'bash'
brew 'zsh'
brew 'zsh-completions'
brew 'starship'
brew 'atuin'
brew 'pinentry-mac'

# Shell Completions
brew 'brew-cask-completion'

# Casks - macOS only
cask 'ghostty'
cask 'rectangle'
cask 'clocker'
cask 'gifcapture'
cask 'google-chrome'
cask 'postman'
cask 'visualvm'
cask 'yed'
cask 'swiftformat-for-xcode'

# Media & Design
cask 'simple-comic'
cask 'transmission'
cask 'vlc'
cask 'drawio'

# Editors & IDEs
cask 'zed'

# Cloud & Utilities
cask 'dropbox'

# Security
cask 'keepassxc'
cask 'nordvpn'

# AI
cask 'claude-code'

# Communication
cask 'discord'
cask 'slack'
cask 'whatsapp'
cask 'zoom'

# Notes & Knowledge
cask 'logseq'
cask 'obsidian'

# Productivity
cask 'tomighty'

# Fonts
cask 'font-fira-code'
cask 'font-victor-mono'
cask 'font-fira-code-nerd-font'
cask 'font-victor-mono-nerd-font'
cask 'font-symbols-only-nerd-font'
