ohmyzsh/ohmyzsh
# best git aliases
ohmyzsh/ohmyzsh path:plugins/git
# zsh configurations
willghatch/zsh-saneopt
# better vim mode
softmoth/zsh-vim-mode
# cx swap text
okapia/zsh-viexchange
# sugest completions based in command history
zsh-users/zsh-autosuggestions
# a lot of command completions
zsh-users/zsh-completions
# ubuntu command not found works now at brew zsh 
ohmyzsh/ohmyzsh path:plugins/command-not-found
# gradle or gradlew doesnt matter anymore
ohmyzsh/ohmyzsh path:plugins/gradle
# urlencode
ohmyzsh/ohmyzsh path:plugins/urltools
# remember if there is an alias for the command you're using
djui/alias-tips
# command to find alias alias-finder -l git
ohmyzsh/ohmyzsh path:plugins/alias-finder
# k = kubectl and also autocomplete work
ohmyzsh/ohmyzsh path:plugins/kubectl
# auto completion for docker
ohmyzsh/ohmyzsh path:plugins/docker
# auto completion for docker-compose + , dcb, dce, etc...
ohmyzsh/ohmyzsh path:plugins/docker-compose
# pbcopy, pbpaste and clip
zpm-zsh/clipboard
# forgit - FZ  git
wfxr/forgit
